# Imports

In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from ucimlrepo import fetch_ucirepo

from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score, f1_score, precision_score, make_scorer
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

# Loading Data

In [21]:
# fetch dataset 
waveform_database_generator_version_1 = fetch_ucirepo(id=107) 
statlog_german_credit_data = fetch_ucirepo(id=144)

In [22]:
# extracting features and tragets for both datasets
german_data_X = statlog_german_credit_data.data.features
german_data_Y = statlog_german_credit_data.data.targets

waveform_data_X = waveform_database_generator_version_1.data.features
waveform_data_Y = waveform_database_generator_version_1.data.targets

In [ ]:
# waveform dataset
display(waveform_data_X.head())
display(waveform_data_Y.head())
non_numeric_w = waveform_data_X.select_dtypes(include='object').columns
display(non_numeric_w)

# Part 1: Inference Efficiency (Statlog German Credit Data)

### 1. Preprocessing

In [24]:
# initial dataset exploration

# german dataset
display(german_data_X.head())
display(german_data_Y.head())
non_numeric_g = german_data_X.select_dtypes(include='object').columns
display(non_numeric_g)

,Attribute1,Attribute2,Attribute3,Attribute4,Attribute5,Attribute6,Attribute7,Attribute8,Attribute9,Attribute10,Attribute11,Attribute12,Attribute13,Attribute14,Attribute15,Attribute16,Attribute17,Attribute18,Attribute19,Attribute20
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,4,A121,67,A143,A152,2,A173,1,A192,A201
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,2,A121,22,A143,A152,1,A173,1,A191,A201
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,3,A121,49,A143,A152,1,A172,2,A191,A201
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,4,A122,45,A143,A153,1,A173,2,A191,A201
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,4,A124,53,A143,A153,2,A173,2,A191,A201

   class
0      1
1      2
2      1
3      1
4      2

Index(['Attribute1', 'Attribute3', 'Attribute4', 'Attribute6', 'Attribute7',
       'Attribute9', 'Attribute10', 'Attribute12', 'Attribute14',
       'Attribute15', 'Attribute17', 'Attribute19', 'Attribute20'],
      dtype='object')

We pre-process categorical features for better minkowski-distance compatibility. The following features have a completely arbitrary ordering or contain only 2 unique values:

- attribute 4: Purpose
    - arbitrary purchases on credit

- attribute 9: Personal status and sex
    - no real ordering to marital status and sex

- attribute 19: Telephone
    - yes or no

- attribute 20: foreign worker
    - yes or no

For these features we use **one-hot encoding** and

In [44]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

# Drop column 'B'
display(df.drop(labels='B', axis=1))
# Drop row with index 1
display(df.drop(labels=1, axis=0))

cat = "meow"
dog = "bark"

arr = np.array([1,2,3,4])
if not isinstance(cat, (tuple, list)):
    cat = [cat]
    print(cat)
else:
    print(cat)

   A  C
0  1  7
1  2  8
2  3  9

   A  B  C
0  1  4  7
2  3  6  9

['meow']

In [63]:
df2 = pd.get_dummies(data=df2, columns=['animals','cars']).apply(lambda x: x.apply(lambda x: int(x) if isinstance(x,bool) else x))
display(df2)

,place,animals_cat,animals_dog,animals_mouse,cars_lambo,cars_bmw,cars_honda
0,canada,1,0,0,1,0,0
1,us,0,1,0,0,1,0
2,mexico,0,0,1,0,0,1
3,pakistan,0,1,0,0,1,0
4,india,1,0,0,0,1,0

,place,animals_cat,animals_dog,animals_mouse,cars_bmw,cars_honda,cars_lambo
0,canada,1,0,0,0,0,1
1,us,0,1,0,1,0,0
2,mexico,0,0,1,0,1,0
3,pakistan,0,1,0,1,0,0
4,india,1,0,0,1,0,0

In [ ]:
display(german_data_Y[german_data_X['Attribute1'] == 'A11'].value_counts())
display(german_data_Y[german_data_X['Attribute1'] == 'A12'].value_counts())
display(german_data_Y[german_data_X['Attribute1'] == 'A13'].value_counts())
display(german_data_Y[german_data_X['Attribute1'] == 'A14'].value_counts())